{
  "projects": [
    {
      "title": "BroBot the Boe-Bot",
      "description": "I'm a Software Engineer by trade, but I always get really excited when I have the opportunity to tinker with hardware. Cue Brobot the Boe-Bot. I bought this robotics kit to become more familiar with embedded programming and robotics. Brobot uses a Parallax BASIC Stamp 2 microcontroller to interface with touch, light, and infrared sensors. These sensors help Brobot navigate his environment.",
      "technologies": [
        "Embedded C",
        "Robotics",
        "Sensors",
        "Microcontrollers"
      ],
      "images": [
        "images/boebot2.jpg"
      ],
      "links": []
    },
    {
      "title": "Intelligent Academic Advisor",
      "description": "My senior project focused on supervised machine learning, utilizing IBM Watson to create a virtual advisor who could assist prospective students with academic planning. My team participated in the Nittany Watson Challenge, creating a minimum viable product that would advance several rounds, and secure funding for further research and development. This is the current state of the project, which has had further development since my graduation, but retains many of the features and much of the knowledge added during my involvement.",
      "technologies": [
        "IBM Watson",
        "Machine Learning",
        "React",
        "Node.js"
      ],
      "images": [],
      "links": [
        {
          "label": "View Live Demo",
          "url": "https://intelligent-student-advisor.herokuapp.com/lite-version.html"
        },
        {
          "label": "Read Project Article",
          "url": "http://news.psu.edu/story/506403/2018/02/20/academics/have-world-campus-question-professor-nittany-can-help"
        },
        {
          "label": "Watch Presentation Part I",
          "url": "https://www.youtube.com/watch?v=3gAqwNpoJxA"
        },
        {
          "label": "Watch Presentation Part II",
          "url": "https://www.youtube.com/watch?v=kRPAQEqDL0o"
        }
      ]
    },
    {
      "title": "College Portfolio Site",
      "description": "When I was in college, I started learning about front end frameworks. My professors recommended having a web presence, so I used Bootstrap to create a page with my at-the-time resume and some information pertaining to projects, classes, and interests.",
      "technologies": [
        "Bootstrap",
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "images": [
        "images/college-portfolio.PNG"
      ],
      "links": [
        {
          "label": "View College Portfolio",
          "url": "http://www.personal.psu.edu/kye5098/portfolio"
        }
      ]
    },
    {
      "title": "Tetris in C",
      "description": "During senior year, I had an Embedded Systems course, in which I was to program Tetris. We used QNX RTOS and C for this course. This was developed in several stages. The first stage involved a GUI design and shape creation. The second stage entailed controlling shape movement and establishing bounds. The third stage required a slight redesign of the GUI because the initial dimensions given to us were incorrect. Finally, we worked on line clearing, shape rotation, and sound implementation. Correction: The final stage was competing to become the ultimate Tetris champion.",
      "technologies": [
        "C",
        "QNX RTOS",
        "Embedded Systems",
        "Game Development"
      ],
      "images": [
        "images/tetris-1.PNG",
        "images/tetris-2.PNG"
      ],
      "links": [
        {
          "label": "Read Blog Post",
          "url": "https://krystropolis.blogspot.com/2017/04/united-blocks-of-america.html#more"
        }
      ]
    }
  ]
}
